     &НаКлиенте
Перем ЗакрытьФорму;



&НаСервере
Процедура ОтправитьНаСервере()
	//УчетнаяЗапись = ПочтовыйМодуль.ПолучитьСистемнуюУчетнуюЗапись(); 
		
	МассивВложений = Новый Массив;    
	ИмяОтправителя = "База 1С Закупки";  
	

	если ВажностьПисьма = "Высокая" тогда
		Важность = ВажностьИнтернетПочтовогоСообщения.Высокая;
	иначеесли ВажностьПисьма = "Наивысшая" тогда
		Важность = ВажностьИнтернетПочтовогоСообщения.Наивысшая;
	иначеесли ВажностьПисьма = "Наименьшая" тогда
		Важность = ВажностьИнтернетПочтовогоСообщения.Наименьшая;
	иначеесли ВажностьПисьма = "Низкая" тогда
		Важность = ВажностьИнтернетПочтовогоСообщения.Низкая;
	иначе
		Важность = ВажностьИнтернетПочтовогоСообщения.Обычная; 
	КонецЕсли;
	МассивВложений=новый Массив;
	для каждого стр из Вложения цикл
		    МассивВложений.Добавить(стр);
	КонецЦикла;
	
	ПочтовыйМодуль.ОтправитьПисьмо(УчетнаяЗапись, тема, Текст, МассивВложений, ОтКого, Кому, УведомитьОДоставке, Скрытые, УведомитьОПрочтении, Важность, ВремяОтправки, ВКопию);

КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();  
закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложение(Команда)    
	
	
	ПараметрыОткрытия = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ВыбратьФайл", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ФормаВыборФайла", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	

КонецПроцедуры

  

      &НаКлиенте
Процедура ВыбратьФайл(ПараметрыЗавершения, ДополнительныеПараметры) Экспорт
	если ПараметрыЗавершения<>Неопределено тогда
		Вложения.Добавить( ПараметрыЗавершения); 
		ТекстВложений=ТекстВложений+ " " +Строка(ПараметрыЗавершения);
	КонецЕсли;
	
	
КонецПроцедуры

