Функция РазобратьФайлРезультатаТекст(ФайлТХТ) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ФИО","");
	СтруктураОтвета.Вставить("ИИН","");
	СтруктураОтвета.Вставить("НомерЗаявки","");
	СтруктураОтвета.Вставить("НомерТеста","");
	СтруктураОтвета.Вставить("ДатаТеста",Дата(1,1,1));
	СтруктураОтвета.Вставить("ТекстРезульата","");
	СтруктураОтвета.Вставить("РезультатПЦР",Перечисления.РезультатыПЦР.ПустаяСсылка());
	СтруктураОтвета.Вставить("ФизЛицо",Справочники.ФизическиеЛица.ПустаяСсылка());
	
	ТекПоле = "ФИО";
	
	ТекстРезультата = Новый ТекстовыйДокумент;
	ТекстРезультата.Прочитать(ФайлТХТ, КодировкаТекста.UTF8);
	
	Для К = 1 по ТекстРезультата.КоличествоСтрок() Цикл
		
		ТекСтрока = ТекстРезультата.ПолучитьСтроку(К);
		Если СтрНайти(ТекСтрока,"Фамилия И.О.:") > 0 Тогда
			ТекПоле = "ФИО";
			ЗначПоля = СокрЛП(СтрЗаменить(ТекСтрока,"Фамилия И.О.:",""));
			
			СтруктураОтвета.Вставить(ТекПоле,ЗначПоля);
		ИначеЕсли ЛЕВ(ТекСтрока,4)="ИИН:" Тогда
			
			ТекПоле = "ИИН";
			ЗначПоля = СокрЛП(СтрЗаменить(ТекСтрока,"ИИН:",""));
			
			СтруктураОтвета.Вставить(ТекПоле,ЗначПоля);
		ИначеЕсли СокрЛП(ТекСтрока) = "№ отчёта" тогда
			
			ТекПоле = "НомерТеста";
			ЗначПоля = СокрЛП(ТекстРезультата.ПолучитьСтроку(К+3));
			
			СтруктураОтвета.Вставить(ТекПоле,ЗначПоля);
			
		ИначеЕсли СокрЛП(ТекСтрока) = "№ заявки:" Тогда
			
			ТекПоле = "НомерЗаявки";
			ЗначПоля = СокрЛП(ТекстРезультата.ПолучитьСтроку(К+2));
			
			СтруктураОтвета.Вставить(ТекПоле,ЗначПоля);
			
		ИначеЕсли СокрЛП(ТекСтрока) = "Обнаружение РНК коронавируса (COVID-19)" Тогда
			
			тРез = СокрЛП(ТекстРезультата.ПолучитьСтроку(К+2));
			ТекПоле = "РезультатПЦР";
			ЗначПоля = ?(тРез="Не обнаружено",Перечисления.РезультатыПЦР.Отрицательный,Перечисления.РезультатыПЦР.Положительный);
			СтруктураОтвета.Вставить(ТекПоле,ЗначПоля);
			
			СтруктураОтвета.Вставить("ТекстРезульата",тРез);
			

			тРез = Лев(СокрЛП(ТекстРезультата.ПолучитьСтроку(К+4)),16)+":00";
			ТекПоле = "ДатаТеста";
			ЗначПоля = Дата(тРез);
			СтруктураОтвета.Вставить(ТекПоле,ЗначПоля);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не СокрЛП(СтруктураОтвета.ИИН) = "" Тогда
		СтруктураОтвета.Вставить("ФизЛицо",Справочники.ФизическиеЛица.НайтиПоРеквизиту("ИдентификационныйНомер",СокрЛП(СтруктураОтвета.ИИН)));
	КонецЕсли;
	
	Возврат СтруктураОтвета;
КонецФункции