
Процедура Пауза(Сек = 10)
	
	ВремяКон  = ТекущаяДата()+Сек;
	Пока ТекущаяДата()<=ВремяКон Цикл
		Я = 1;
	КонецЦикла;
	
КонецПроцедуры	

////Процедура РазобратьВложенныеФайлыРезультатовТестирования() Экспорт 
////	
////	//ПутьКPDFtoTEXT = "E:\TestPDF\"; 
////	ПутьКPDFtoTEXT = Константы.КаталогПриложенияКонвертацииPDFФайлов.Получить();
////	Если Прав(СокрЛП(ПутьКPDFtoTEXT),1) = "\" Тогда
////	Иначе
////		ПутьКPDFtoTEXT = СокрЛП(ПутьКPDFtoTEXT)+"\";
////	КонецЕсли;
////	
////	Для Каждого СтрокаВФ из  ВложенныеФайлы Цикл
////		
////		Если Прав(СтрокаВФ.ИмяФайла,3) = "pdf" Тогда
////			
////			
////			Если Не СокрЛП(СтрокаВФ.ПолныйПутьКФайлу) = "" Тогда
////				
////				ИсхФайл = Новый Файл(СокрЛП(СтрокаВФ.ПолныйПутьКФайлу));
////				Если ИсхФайл.Существует() Тогда
////					
////					
////					ФайлПДФ = ПолучитьИмяВременногоФайла("pdf");					
////					ФайлТХТ = ПолучитьИмяВременногоФайла("txt");
////					
////					КопироватьФайл(СокрЛП(СтрокаВФ.ПолныйПутьКФайлу),ФайлПДФ);
////					
////					Команд = ПутьКPDFtoTEXT +"pdftotext.exe " + "-enc UTF-8 " + ФайлПДФ  + " " + ФайлТХТ; 
////			
////					//Сообщить(Команд);
////					УстановитьПривилегированныйРежим(Истина);
////					ЗапуститьПриложение(Команд);	
////					УстановитьПривилегированныйРежим(Ложь);
////					Пауза();
////					
////					ИсхФайл = Новый Файл(ФайлТХТ);
////					Если ИсхФайл.Существует() Тогда
////						
////						СтруктураОтвета = Документы.ЭлектронноеПисьмоВходящее.РазобратьФайлРезультатаТекст(ФайлТХТ);
////						ЗаполнитьЗначенияСвойств(СтрокаВФ,СтруктураОтвета);
////					КонецЕсли;	
////					
////				КонецЕсли;	
////			
////			КонецЕсли;
////			
////		КонецЕсли;
////		
////	КонецЦикла;
////	Записать();
////	
////КонецПроцедуры