
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) ТОгда //новый
				
	КонецЕсли;
	
	ИнтервалЗапуска = ПолучитьИнтервалЗапускаОтправки(); 
	
	ИнтервалЗапускаПолучения = ПолучитьИнтервалЗапускаОтправкиПолучения(); 

КонецПроцедуры  

&насервере
функция ПолучитьИнтервалЗапускаОтправки()
	 Задание = РегламентныеЗадания.ПолучитьРегламентныеЗадания(новый Структура("Метаданные", Метаданные.РегламентныеЗадания["ОтправкаОтложенныхПисем"]))[0];  
	возврат Задание.Расписание.ПериодПовтораВТечениеДня;
	
КонецФункции


&насервере
функция ПолучитьИнтервалЗапускаОтправкиПолучения()
	 Задание = РегламентныеЗадания.ПолучитьРегламентныеЗадания(новый Структура("Метаданные", Метаданные.РегламентныеЗадания["ПолучениеПочты"]))[0];   
	возврат Задание.Расписание.ПериодПовтораВТечениеДня;
	
КонецФункции




&НаКлиенте
Процедура СФормироватьНаименование()
	
	Объект.Наименование = СокрЛП(Объект.ИмяПользователя) + " "+СокрЛП(Объект.АдресЭлектроннойПочты);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресЭлектроннойПочтыПриИзменении(Элемент)
	
	СФормироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПользователяПриИзменении(Элемент)
	
	СФормироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогХраненияФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 

	Если ДиалогОткрытия.Выбрать() Тогда 
		Объект.КаталогХраненияФайлов = ДиалогОткрытия.Каталог; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьПисьмаНаСервере()
		ПочтовыйМодуль.ЗагрузитьИОбработатьПочтовыеСообщения(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПисьма(Команда)
	ПолучитьПисьмаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ИспользоватьАвтоотправку тогда
		МенеджерЗаписи = РегистрыСведений.УчетныеЗаписиНаАвтоОтправлениеПисем.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.УчетнаяЗапись = Объект.Ссылка; 
		МенеджерЗаписи.Записать();    	
	иначе
	 	НаборЗаписей = РегистрыСведений.УчетныеЗаписиНаАвтоОтправлениеПисем.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УчетнаяЗапись.Установить(Объект.Ссылка);
		НаборЗаписей.Записать();   	
	КонецЕсли;    
	
	
	Если Объект.ИспользоватьАвтополучение тогда
		МенеджерЗаписи = РегистрыСведений.УчетныеЗаписиНаАвтополучениеПисем.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.УчетнаяЗапись = Объект.Ссылка; 
		МенеджерЗаписи.Записать();    	
	иначе
	 	НаборЗаписей = РегистрыСведений.УчетныеЗаписиНаАвтополучениеПисем.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УчетнаяЗапись.Установить(Объект.Ссылка);
		НаборЗаписей.Записать();   	
	КонецЕсли;

	
	
	
КонецПроцедуры


