
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
		ТекПользователь = Справочники.Пользователи.НайтиПоНаименованию(ПолноеИмяПользователя());
	Если НЕ ЗначениеЗаполнено(ТекПользователь) Тогда
		//Эл = Справочники.Пользователи.СоздатьЭлемент();
		Эл = Справочники.Пользователи.СоздатьЭлемент();
		Эл.Наименование = ПолноеИмяПользователя();
		//Эл.ПолнНаименование = ПолноеИмяПользователя();
		Эл.Записать();
		ПараметрыСеанса.ТекущийПользователь = Эл.Ссылка;
	Иначе	
	    ПараметрыСеанса.ТекущийПользователь = ТекПользователь;
	КонецЕсли;  
	
	//***
КонецПроцедуры
