процедура МониторингНапоминаний() экспорт
	      
		ПараметрыВвода =  ОтправкаУведомлений.ОтправитьУведомления(); 
		
		 
	
		Для Каждого ТекЭлем из ПараметрыВвода Цикл  
			
			ФормаОткрыта = ОтправкаУведомлений.ПроверитьОткрытаЛиФормаУведомления(ТекЭлем.Значение.IDУведмления);
			
			если не ФормаОткрыта  тогда
				//@skip-check undefined-function
				если ТекЭлем.Значение.ОтложенНа= '00010101' или ТекЭлем.Значение.ОтложенНа<=ТекущаяДатаСеанса() тогда
					ПараметрыУведомления = Новый Структура;
			
				    ПараметрыУведомления.Вставить("Автор", ТекЭлем.Значение.Автор);
			        ПараметрыУведомления.Вставить("Сообщение", ТекЭлем.Значение.Сообщение);
			        ПараметрыУведомления.Вставить("Статус", ТекЭлем.Значение.Статус); 
			    	ПараметрыУведомления.Вставить("IDУведмления", ТекЭлем.Значение.IDУведмления); 
					ПараметрыУведомления.Вставить("Прочитан", ТекЭлем.Значение.прочитан);  
					ПараметрыУведомления.Вставить("Закрыт", Ложь); 
					ПараметрыУведомления.Вставить("МассивНаименованийФайлов", ТекЭлем.Значение.МассивНаименованийФайлов);
					ПараметрыУведомления.Вставить("МассивIDФайлов", ТекЭлем.Значение.МассивIDФайлов);
					ПараметрыУведомления.Вставить("МассивТиповФайлов", ТекЭлем.Значение.МассивТиповФайлов);
					ПараметрыУведомления.Вставить("ПоказатьОдинРаз", ТекЭлем.Значение.ПоказатьОдинРаз);
					ПараметрыУведомления.Вставить("массивНаименованиеСсылки", ТекЭлем.Значение.массивНаименованиеСсылки);
					ПараметрыУведомления.Вставить("массивСсылок", ТекЭлем.Значение.массивСсылок); 
					ПараметрыУведомления.Вставить("РазрешитьОткладыватьНа15", ТекЭлем.Значение.РазрешитьОткладыватьНа15);
					ПараметрыУведомления.Вставить("РазрешитьОткладыватьНа30", ТекЭлем.Значение.РазрешитьОткладыватьНа30);
					ПараметрыУведомления.Вставить("РазрешитьОткладыватьНа45", ТекЭлем.Значение.РазрешитьОткладыватьНа45);
					ПараметрыУведомления.Вставить("РазрешитьОткладыватьНа1час", ТекЭлем.Значение.РазрешитьОткладыватьНа1час);

					 
					ОтправкаУведомлений.ЗавестиМассивУведомлений(ТекЭлем.Значение.IDУведмления);	 
			 
			 
					ОткрытьФорму("ОбщаяФорма.ФормаУведомлений",ПараметрыУведомления,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				КонецЕсли; 
				КонецЕсли;
		      

	КонецЦикла;
 	

КонецПроцедуры

