
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Заголовок = Объект.Тема;
	ЭтаФорма.ТолькоПросмотр = Истина;
	
	тПредставлениеОтправителя = СокрЛП(Объект.ОтправительПредставление) + " <"+ СокрЛП(Объект.ОтправительАдрес) +">";
	
	Если Объект.ТипТекста = ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.HTML") или 
		Объект.ТипТекста = ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.HTMLСКартинками") тогда
		Элементы.ГруппаТекстHTML.Видимость = Истина;
		Элементы.ГруппаТекст.Видимость = Ложь;
	Иначе
		Элементы.ГруппаТекстHTML.Видимость = ложь;
		Элементы.ГруппаТекст.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	текДан = Элементы.ВложенныеФайлы.ТекущаяСтрока;
	текДанные = Элементы.ВложенныеФайлы.ТекущиеДанные;
	если текДан<>неопределено и ЗначениеЗаполнено(текДанные.ПолныйПутьКФайлу) тогда
		ДанныеФайла = текДанные.ПолныйПутьКФайлу;                                 
			списокКнопокВопроса = новый СписокЗначений ();
			
			списокКнопокВопроса.Добавить("Скачать","Скачать");
			списокКнопокВопроса.Добавить("Отмена","Отмена");
			
			оповещение = новый ОписаниеОповещения ("ОбработатьОтветНаВопрос",ЭтотОбъект,ДанныеФайла);
			ПоказатьВопрос(оповещение,"Выберите действие",списокКнопокВопроса,30,"Скачать","Что хотите сделать?","Отмена");
			
		иначе
			ПоказатьПредупреждение(,"данные не найдены");
		КонецЕсли;		
	

КонецПроцедуры



&НаКлиенте
процедура ОбработатьОтветНаВопрос (РезультатВопроса,ДополнительныеПараметры) экспорт
	текДан = Элементы.ВложенныеФайлы.ТекущаяСтрока;
	текДанные = Элементы.ВложенныеФайлы.ТекущиеДанные;
	
	времХранилище="";
	если	РезультатВопроса = "Скачать" тогда
		времХранилище = ПоместитьВоВременноеХранилище(ДополнительныеПараметры,ЭтаФорма.УникальныйИдентификатор);
		НачатьПолучениеФайлаССервера(времХранилище, текДанные.ПолныйПутьКФайлу);
		удалитьНаСервере(времХранилище);
	иначе
		возврат;
	КонецЕсли;
	
	
	
КонецПроцедуры


&насервере
процедура удалитьНаСервере(времХранилище)
	УдалитьФайлы(времХранилище)
	КонецПроцедуры


