
&НаКлиенте
Процедура ПовторнаяОтправка(Команда)
	МассивСтрок = ЭтаФорма.Элементы.Список.ВыделенныеСтроки;  
	
	 ОтправитьПисьмо(МассивСтрок);
КонецПроцедуры


&насервере
Процедура ОтправитьПисьмо(МассивСтрок)     
	
	    для каждого Мстр из МассивСтрок цикл

	     МассивВложений  = новый Массив;
		 МассивВложенийСписком = СтрЗаменить(СокрЛП(Мстр.МассивВложений),",",Символы.ПС);
		 
				Для Индекс = 1 По СтрЧислоСтрок(МассивВложенийСписком) Цикл
			        ТекущееВложение = СтрПолучитьСтроку(МассивВложенийСписком, Индекс); 
					если ТекущееВложение<>"" тогда
						МассивВложений.Добавить(СокрЛП(ТекущееВложение)); 
					КонецЕсли;
				КонецЦикла; 
				
				
				
				если Мстр.Важность = "Высокая" тогда
		Важность = ВажностьИнтернетПочтовогоСообщения.Высокая;
	иначеесли Мстр.Важность = "Наивысшая" тогда
		Важность = ВажностьИнтернетПочтовогоСообщения.Наивысшая;
	иначеесли Мстр.Важность = "Наименьшая" тогда
		Важность = ВажностьИнтернетПочтовогоСообщения.Наименьшая;
	иначеесли Мстр.Важность = "Низкая" тогда
		Важность = ВажностьИнтернетПочтовогоСообщения.Низкая;
	иначе
		Важность = ВажностьИнтернетПочтовогоСообщения.Обычная; 
	КонецЕсли;

	
	
				ПочтовыйМодуль.ОтправитьПисьмо(Мстр.УчетнаяЗапись, Мстр.Тема, Мстр.Тело, МассивВложений, Мстр.ИмяОтправителя, Мстр.МассивПолучателей, Мстр.УведомитьОДоставке, Мстр.МассивСкрытыхПолучателей, Мстр.УведомитьОПрочтении, Важность,,);
		КонецЦикла; 

		
	КонецПроцедуры