
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьРегЗадание(); 
	ЗаполнитьРегЗаданиеВходящ();
			ТекстРасписания=   ОбновитьТекстраесписания(); 
			ТекстРасписанияВходящ =  ОбновитьТекстраесписанияВходящ();


КонецПроцедуры        

&НаСервере
процедура ЗаполнитьРегЗадание()
	Задание = РегламентныеЗадания.ПолучитьРегламентныеЗадания(новый Структура("Метаданные", Метаданные.РегламентныеЗадания["ОтправкаОтложенныхПисем"]))[0];  
		
		Расписание=Задание.Расписание; 
	//	ЭтаФорма.Элементы.ТекстРасписание.Заголовок= строка(Расписание);
		
		Объект.ДатаНачала=Задание.Расписание.ДатаНачала;  
		Объект.ДатаОкончания = Задание.Расписание.ВремяКонца;  
		Объект.Использовать= Задание.Использование;
		Объект.ИнтервалЗапуска= Задание.Расписание.ПериодПовтораВТечениеДня;
		
	КонецПроцедуры   
	
	
	&НаСервере
процедура ЗаполнитьРегЗаданиеВходящ()
	ЗаданиеВходящ = РегламентныеЗадания.ПолучитьРегламентныеЗадания(новый Структура("Метаданные", Метаданные.РегламентныеЗадания["ПолучениеПочты"]))[0];  
		
		РасписаниеВходящ=ЗаданиеВходящ.Расписание; 
	//	ЭтаФорма.Элементы.ТекстРасписание.Заголовок= строка(Расписание);
		
		Объект.ДатаНачалаВходящ=ЗаданиеВходящ.Расписание.ДатаНачала;  
		Объект.ДатаОкончанияВходящ = ЗаданиеВходящ.Расписание.ВремяКонца;  
		Объект.ИспользоватьВходящ= ЗаданиеВходящ.Использование;
		Объект.ИнтервалЗапускаВходящ= ЗаданиеВходящ.Расписание.ПериодПовтораВТечениеДня;
		
	КонецПроцедуры

	
	

&НаСервере
	Процедура ОкНаСервере()
			Задание = РегламентныеЗадания.ПолучитьРегламентныеЗадания(новый Структура("Метаданные", Метаданные.РегламентныеЗадания["ОтправкаОтложенныхПисем"]))[0];  
		
		Расписание=Задание.Расписание; 
		
		
		Задание.Расписание.ДатаНачала = Объект.ДатаНачала; 
		Задание.Расписание.ВремяНачала = Дата("00010101") ;
		Задание.Расписание.ВремяКонца = Объект.ДатаОкончания;  
		Задание.Использование = Объект.Использовать;
		Задание.Расписание.ПериодПовтораВТечениеДня = Объект.ИнтервалЗапуска; 
		
		Задание.записать(); 
		
		
		ЗаданиеВходящ = РегламентныеЗадания.ПолучитьРегламентныеЗадания(новый Структура("Метаданные", Метаданные.РегламентныеЗадания["ПолучениеПочты"]))[0];  
		
		Расписание=ЗаданиеВходящ.Расписание; 		
		ЗаданиеВходящ.Расписание.ДатаНачала = Объект.ДатаНачалаВходящ; 
		ЗаданиеВходящ.Расписание.ВремяНачала = Дата("00010101") ;
		ЗаданиеВходящ.Расписание.ВремяКонца = Объект.ДатаОкончанияВходящ;  
		ЗаданиеВходящ.Использование = Объект.ИспользоватьВходящ;
		ЗаданиеВходящ.Расписание.ПериодПовтораВТечениеДня = Объект.ИнтервалЗапускаВходящ; 
		ЗаданиеВходящ.записать();

		
			КонецПроцедуры

&НаКлиенте
	Процедура Ок(Команда)
		ОкНаСервере(); 
		закрыть();

	КонецПроцедуры

&НаСервере
	Функция  ОбновитьТекстраесписания()
		возврат "С "+ Строка(Формат(Объект.ДатаНачала,"ДЛФ=DD" ))+" каждый день; каждые "+строка(Объект.ИнтервалЗапуска)+" секунд"; 
		
	КонецФункции 
	
	
	&НаСервере
	Функция  ОбновитьТекстраесписанияВходящ()
		возврат "С "+ Строка(Формат(Объект.ДатаНачалаВходящ,"ДЛФ=DD" ))+" каждый день; каждые "+строка(Объект.ИнтервалЗапускаВходящ)+" секунд"; 
		
	КонецФункции

	
	

&НаКлиенте
Процедура ИнтервалЗапускаПриИзменении(Элемент) 
	
		ТекстРасписания=   ОбновитьТекстраесписания();
	КонецПроцедуры

&НаКлиенте
	Процедура ДатаНачалаПриИзменении(Элемент)
		
		ТекстРасписания=   ОбновитьТекстраесписания();
	КонецПроцедуры

&НаКлиенте
	Процедура ДатаОкончанияПриИзменении(Элемент)
		
		ТекстРасписания=   ОбновитьТекстраесписания();		
	КонецПроцедуры


&НаКлиенте
	Процедура ДатаНачалаВходящПриИзменении(Элемент)
		ТекстРасписанияВходящ = ОбновитьТекстраесписанияВходящ();
	КонецПроцедуры


&НаКлиенте
	Процедура ДатаОкончанияВходящПриИзменении(Элемент)
		ТекстРасписанияВходящ = ОбновитьТекстраесписанияВходящ();
	КонецПроцедуры


&НаКлиенте
	Процедура ИнтервалЗапускаВходящПриИзменении(Элемент)
		ТекстРасписанияВходящ = ОбновитьТекстраесписанияВходящ();
	КонецПроцедуры

