
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	//Фильтр = "EXE (*.exe)|*.exe"; 
	//Диалог.Фильтр = Фильтр; 
    Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = "C:\";
	Если Диалог.Выбрать() Тогда
		Файл = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Добавить(Команда)      
	
	Закрыть(Файл);

	
	//ПарамЗавершения = Новый Структура("Таблица", ЗначениеВСтрокуВнутр(ТаблицаРезультат));
	//возврат ПарамЗавершения;
КонецПроцедуры

